In [1]:
#Connecting to MySQL using Python
import mysql.connector
from mysql.connector import Error

In [3]:
#Connecting to database
try:
    conn = mysql.connector.connect(host = '127.0.0.1',
                                database = 'company',
                                user = 'root',
                                password = 'Fri21052021')
    if conn.is_connected():
        db_info = conn.get_server_info()
        print("Connected successfully to MySQL Server Version", db_info)
    
except Error as e:
    print("Error connecting to MySQL", e)

Connected successfully to MySQL Server Version 8.0.25

In [4]:
#Creating a cursor
c = conn.cursor()

In [5]:
#Creating the Employee table
table = """CREATE TABLE Employee (
employee_id int, first_name varchar(250), last_name varchar(250), email varchar(250), phone_number varchar(12), 
hire_date date, job_id int, salary float, manager_id int, department_id int)"""
    
c.execute(table)
print("Employee table created")

Employee table created

In [6]:
#Creating Departments table
table = """CREATE TABLE Departments(
department_id varchar(10), department_name varchar(50), location_id varchar(10)
)"""

c.execute(table)
print("Departments table created")

Departments table created

In [7]:
#Creating Jobs table
table = """CREATE TABLE Jobs(
job_id varchar(10), job_title varchar(250), min_salary float, max_salary float
)"""

c.execute(table)
print("Jobs table created")

Jobs table created

In [9]:
#Adding data to the Employees table
Employee_info=[
    (1, 'Mark', 'Mwenda', 'markmwenda@gmail.com', '0799000000', '2010-12-09', 1, 250000, 1, 7),
    (2, 'Dennis', 'Kariuki', 'denniskariuki@gmail.com', '0798111111', '2011-02-01', 2, 185000, 2, 6),
    (3, 'Pauline', 'Wairimu', 'paulinewairimu@gmail.com', '0797222222', '2011-03-07', 3, 177000, 3, 6),
    (4, 'Mary', 'Njeri', 'marynjeri@gmail.com', '0796333333', '2011-04-03', 4, 75000, 4, 2),
    (5, 'Jack', 'Korir', 'jackkorir@gmail.com', '0795444444', '2011-05-01', 5, 70000, 4, 4),
    (6, 'Ann', 'Wachuka', 'annwachuka@gmail.com', '0794555555', '2011-06-02', 6, 67000, 4, 2),
    (7, 'Steve', 'Kilonzo', 'stevekilonzo@gmail.com', '0793666666', '2011-07-01', 7, 65000, 4, 5),
    (8, 'Fiona', 'Atieno', 'fionaatieno@yahoo.com', '0792777777', '2011-08-02', 8, 63000, 4, 3),
    (9, 'Frank', 'Nyongesa', 'franknyongesa@gmail.com', '0791888888', '2011-09-03',9, 60000, 4, 7),
    (10, 'Philip', 'Otieno', 'philipotieno@gmail.com', '0790999999', '2011-10-01', 10, 60000, 4, 1)
]

c.executemany("INSERT INTO Employee VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)", Employee_info)
conn.commit
print("Data added to Employees table")

Data added to Employees table

In [10]:
#Adding data to Departments table
Department_info=[
    (1, 'Engineering', 20),
    (2, 'Sales & Marketing', 20),
    (3, 'Customer Care', 10),
    (4, 'Human Resource', 10),
    (5, 'ICT', 20),
    (6, 'Operations', 30),
    (7, 'Administration', 30),
]

c.executemany("INSERT INTO Departments VALUES(%s,%s,%s)", Department_info)
conn.commit
print("Data added to Departments table")

<>:7: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
<>:7: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
<ipython-input-10-abf52dae8ffc>:7: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
  (5, 'ICT', 20)

TypeError: 'tuple' object is not callable

In [ ]:
#Adding data to jobs table
Job_info=[
    (1, 'CEO', 230000, 250000),
    (2, 'COO', 175000, 185000),
    (3, 'Operations Manager', 64000, 67000),
    (4, 'Marketing Coordinator', 62000, 65000),
    (5, 'Human Resource Manager', 65000,70000),
    (6, 'Sales Officer', 60000, 63000),
    (7, 'Web Designer', 70000, 75000),
    (8, 'Customer Care Officer', 60000, 60000),
    (9, 'Receptionist', 60000, 60000),
    (10, 'Chief Engineer', 170000, 177000)
]

c.executemany("INSERT INTO Jobs VALUES(%s,%s,%s,%s)", Job_info)
conn.commit
print("Data added to Jobs table")

In [ ]:
#Displaying contents of the Employee table
table="SELECT * FROM Employee"

c.execute (table)
result=c.fetchall()
for row in result:
    print (row)

In [ ]:
#Displaying the contents of the Department table
table = "SELECT * FROM Departments"

c.execute(table)
result=c.fetchall()
for row in result:
    print(row)

In [ ]:
table = "SELECT * FROM Jobs"

c.execute(table)
result=c.fetchall()
for row in result:
    print(row)

In [ ]:
#Displaying the contents of all the 3 tables
table = "SELECT * FROM Employee INNER JOIN Departments ON Departments.Department_ID = Employee.Department_ID INNER JOIN Jobs ON Jobs.Job_ID =Employee.Job_ID"

c.execute(table)
result=c.fetchall()
for row in result:
    print(row)

In [ ]:
#Updating the Employee table
New_staff = [
    (91, 'Annabel','Nganga','annabel_nganga@gmail.com', '0719000000', '2012-02-10', 5, 70000, 4, 4),
    (92, 'Esther','Wambui', 'esther_wambui@gmail.com', '0718111111', '2012-01-08', 7, 75000, 4, 5),
    (94, 'Migot', 'Ndede', 'migot_ndede@gmail.com', '0717222222', '2012-01-11', 10, 177000, 3, 7)
]

c.executemany("INSERT INTO Employee VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)", New_Staff)
conn.commit
print("Employee Table Updated")

In [ ]:
#Alter the table Employee
table = "ALTER TABLE Employee ADD Cellphone varchar(12), ADD Physical_Address varchar(250);"

c.execute(table)
print("Table structure altered")

In [ ]:
#Updating Employee's Table
table = "UPDATE Employee SET First_Name= 'George' WHERE Employee_id=94"

c.execute(table)
conn.commit()
print("Employee's Table Updated")

In [ ]:
#Displaying the updated table
table = "SELECT * FROM Employee WHERE Employee_id=94"

c.execute(table)
result=c.fetchall()
for row in result:
    print(row)

In [ ]:
#Deleting employee id 94  
table = "DELETE FROM Employee WHERE Employee_id=94"

c.execute(table)
conn.commit()
print("Employee deleted")